# DASwin-YOLO — Deformable Attention Swin YOLO
# Architecture: CSP + DC3SWT Backbone + BiFPN Neck + CoordAtt + 4-Scale Heads (P2–P5)
# DC3SWT: deformable attention replaces W-MSA+SW-MSA, see arxiv:2010.04159
#
# DASwin-YOLO replaces the fixed-window Swin attention (C3SWT) with
# Multi-Scale Deformable Attention (MSDA), making the architecture adaptive
# to object location and scale without relying on pre-defined spatial windows.
#
# Usage:
#   python train_swinyolo.py --data data/your_dataset.yaml --cfg models/yolov5s_dc3swt.yaml
#
# Override nc via your dataset yaml. Regenerate anchors with:
#   python utils/ciou_kmeans.py --label-dir /path/to/labels --img-size <imgsz> --n-clusters 12

# Parameters
nc: 80           # COCO default; override via your data yaml
depth_multiple: 0.33   # model depth multiple  (YOLOv5s scale)
width_multiple: 0.50   # layer channel multiple (YOLOv5s scale)

# Default anchors — COCO-scale, 4 detection levels (P2–P5) at 640px
# For best results regenerate with ciou_kmeans.py for your dataset
anchors:
  - [4,5,  6,10,  10,8]          # P2/4  — tiny objects
  - [10,13, 16,30, 33,23]        # P3/8  — small objects
  - [30,61, 62,45, 59,119]       # P4/16 — medium objects
  - [116,90, 156,198, 373,326]   # P5/32 — large objects

# Backbone: YOLOv5s-CSP with DC3SWT at P5
# DC3SWT: deformable attention replaces W-MSA+SW-MSA, see arxiv:2010.04159
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
    [-1, 6, C3, [256]],             # 4
    [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
    [-1, 9, C3, [512]],             # 6
    [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
    [-1, 3, DC3SWT, [1024]],        # 8 — DC3SWT: deformable attention @ P5
    [-1, 1, SPPF, [1024, 5]],       # 9
  ]

# Neck: PANet top-down (DC3SWT at every level) + BiFPN cross-scale fusion
# DC3SWT: deformable attention replaces W-MSA+SW-MSA, see arxiv:2010.04159
head: [
    # --- Top-Down PANet Pathway (DC3SWT at P4, P3, P2) ---
    [-1, 1, Conv, [512, 1, 1]],                  # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 11
    [[-1, 6], 1, Concat, [1]],                   # 12  cat backbone P4
    [-1, 3, DC3SWT, [512, False]],               # 13  DC3SWT @ P4

    [-1, 1, Conv, [256, 1, 1]],                  # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 15
    [[-1, 4], 1, Concat, [1]],                   # 16  cat backbone P3
    [-1, 3, DC3SWT, [256, False]],               # 17  DC3SWT @ P3

    # Extra P2 scale — ultra-high resolution head for tiny objects
    [-1, 1, Conv, [128, 1, 1]],                  # 18
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 19
    [[-1, 2], 1, Concat, [1]],                   # 20  cat backbone P2
    [-1, 3, DC3SWT, [128, False]],               # 21  DC3SWT @ P2

    # --- BiFPN Cross-Scale Fusion ---
    # Inputs: [P2(21), P3(17), P4(13), P5(9)]
    # use_dcn=True: DeformConv2d at P3 for improved small-object spatial alignment
    [[21, 17, 13, 9], 1, BiFPNLayer, [256, True]],   # 22  BiFPN → list of 4 tensors

    # --- Coordinate Attention (one CA layer per scale) ---
    [-1, 1, CoordAttMulti, [256, 256]],               # 23

    # --- Detection Head (P2, P3, P4, P5) ---
    [-1, 1, Detect, [nc, anchors]],                   # 24
  ]
